app/Controllers/dosen.php

SELECT *
FROM `dosen`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `dosen`
---
    public function list()
    {
        $data = [
            'data'  => $this->dosen->paginate('2', 'dosen'),
            'title' => 'List Dosen',
            'pager' => $this->dosen->pager,
        ];

INSERT INTO `dosen` (`Nama_dosen`, `Alamat_dosen`, `Matkul`) VALUES ('abdullah', 'serang', 'AIK')
---
    public function simpan()
    {
        $data = $this->request->getPost();

        if (! $this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->dosen->save($data);

UPDATE `dosen` SET `Nama_dosen` = 'anis', `Alamat_dosen` = 'tangerang', `Matkul` = 'pancasila'
WHERE `dosen`.`id_dosen` IN (4)
---
    public function update(int $id)
    {
        $data = $this->request->getPost();

        if (! $this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->dosen->update($id, $data);